Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: See ComObjType for a list of type codes.
ja: タイプコードの一覧はComObjTypeを参照してください。

source: See Enumeration.
ja: エニュメレーションを参照してください。

source: See GUI's +/-Theme option for details.
ja: 詳しくはGUIの+/-Themeオプションをご覧ください。

source: See Microsoft Docs for more information.
ja: 詳しくはMicrosoft Docsをご覧ください。

source: See Wikipedia's Indentation style page for various styles and examples.
ja: さまざまなスタイルと例については、ウィキペディアのインデントのスタイルのページを参照のこと。

source: See above for the full list.
ja: 全リストは上記をご覧ください。

source: See also Command Line Parameter "Script Filename" and Portability of AutoHotkey.exe.
ja: コマンドラインパラメータ「スクリプトファイル名」、AutoHotkey.exeの移植性についてもご覧ください。

source: See also Error Handling further below.
ja: 後述の「エラー処理」もご覧ください。

source: See also the GUI's -DPIScale option.
ja: GUIの-DPIScaleオプションも参照してください。

source: See also:
ja: こちらもご覧ください：

source: See also: Base, ObjSetBase, Obj.Base
ja: こちらも参照のこと：Base、ObjSetBase、Obj.Base

source: See also: Changes from v1.1 to v2.0.
ja: こちらも参照のこと：v1.1からv2.0への変更点。

source: See also: Concatenation
ja: こちらも参照のこと：連結

source: See also: Context-sensitive Hotkeys.
ja: こちらも参照のしてください：文脈依存のホットキー。

source: See also: DefineProp
ja: こちらも参照のこと：DefineProp

source: See also: ObjGetBase, ObjSetBase
ja: こちらも参照のこと：ObjGetBase、ObjSetBase

source: See also: ObjGetBase, ObjSetBase, Obj.Base
ja: こちらも参照のこと：ObjGetBase、ObjSetBase、Obj.Base

source: See also: Objects
ja: こちらも参照のこと：オブジェクト

source: See also: maybe (var?), or-maybe (??)
ja: こちらも参照のこと：maybe（var?）、or-maybe （??）

source: See also: other debugging methods
ja: こちらも参照のこと：他のデバッグ方法

source: See also: unset (Optional Parameters)
ja: こちらも参照のこと：unset（オプション・パラメータ）

source: See also: Clone (Array), Clone (Map).
ja: こちらも参照のこと：Clone（Array）、Clone（Map）。

source: See also: Name property (Func)
ja: こちらも参照のこと：Nameプロパティ（Func）

source: See also: StrPut/StrGet.
ja: こちらもご覧ください：StrPut/StrGet。

source: See also: Uninitialized Variables.
ja: こちらもご覧ください：未初期化変数。

source: See also: #Requires and VerCompare
ja: こちらも参照のこと：#Requires、VerCompare

source: See also: Special Keys
ja: こちらも参照のこと：特殊キー

source: See also: Dereference, ByRef.
ja: こちらも参照のこと：デリファレンス、ByRef。

source: See also: command line switches and syntax.
ja: こちらも参照のこと：コマンドラインスイッチとシンタックス。

source: See below for examples of how this might be used.
ja: 使用例については、以下をご覧ください。

source: See below for other modifiers.
ja: その他の修飾語については以下を参照のこと。

source: See below.
ja: 下記をご覧ください。

source: See remarks below.
ja: 下記の備考をご覧ください。

source: See the Key List for a complete list of key and mouse button names.
ja: キーとマウスボタンの名前の完全なリストは、キーリストを参照してください。

source: See the Key List for the complete list of keys and mouse/controller buttons.
ja: キーとマウス/コントローラボタンの完全なリストは、キーリストを参照してください。

source: See the Message Tutorial for an introduction to using this function.
ja: この機能の使い方については、「メッセージチュートリアル」をご覧ください。

source: See the ToolTip example on the Gui object page.
ja: GuiオブジェクトのページのToolTipの例をご覧ください。

source: See the WinLIRC client script for a demonstration of how to use DllCall to make a network connection to a TCP/IP server and receive data from it.
ja: DllCallを使用してTCP/IPサーバーにネットワーク接続し、そこからデータを受信する方法のデモについては、WinLIRCクライアントスクリプトを参照してください。

source: See the WinLIRC client script for a demonstration of how to use OnMessage to receive a notification when data has arrived on a network connection.
ja: ネットワーク接続でデータが到着したときに通知を受け取るOnMessageの使い方のデモは、WinLIRCクライアントスクリプトをご覧ください。

source: See the WinLIRC client script for a demonstration of how to use OnMessage to receive notification when data has arrived on a network connection.
ja: ネットワーク接続でデータが到着したときに通知を受け取るOnMessageの使い方の例は、WinLIRCクライアントスクリプトをご覧ください。

source: See the function list for examples.
ja: 例として、機能一覧をご覧ください。

source: See the joystick remapping page and the Joystick-To-Mouse script for other examples.
ja: 他の例については、ジョイスティックのリマッピングページと Joystick-To-Mouseスクリプトを参照してください。

source: See the message list to determine the number.
ja: メッセージリストを参照して番号を決定してください。

source: See the styles table for a partial listing of styles.
ja: スタイルの一部については、スタイル表をご覧ください。

source: See the Key List for a complete list of keyboard keys and mouse/joystick buttons.
ja: キーボードのキーとマウス／ジョイスティックのボタンの完全なリストは、「キーリスト」を参照してください。

source: See the ListView styles table for a list.
ja: 一覧はListViewのスタイルの表を参照してください。

source: See the TreeView styles table for a list.
ja: 一覧はTreeViewスタイルの表を参照。

source: See the key list for available key names.
ja: 使用可能なキー名については、キーリストを参照してください。

source: See the remapping page for examples.
ja: 例については、リマッピングページをご覧ください。

source: See the override page for details.
ja: 詳しくはオーバーライドページをご覧ください。

source: See the Examples section for usage examples.
ja: 使用例については、「使用例」をご参照ください。

source: See the documentation for more details.
ja: 詳しくはドキュメントをご覧ください。

source: See the examples at the bottom of this page.
ja: 本ページ下部の例をご覧ください。

source: See the list above.
ja: 上記のリストを参照。

source: See the tables below for allowed values.
ja: 許容される値については、以下の表を参照してください。

source: See the v2 documentation for details.
ja: 詳しくはv2のドキュメントをご覧ください。

source: Seek (Search the Start Menu)
ja: シーク（スタートメニューの検索）

source: Select Folder (Directory).
ja: フォルダー（ディレクトリ）を選択します。

source: Select a menu item by left-clicking it.
ja: メニュー項目を左クリックして選択する。

source: Select a region that does not vary and that is unique to the image.
ja: ばらつきがなく、画像に特徴がある領域を選択します。

source: Select next track in media player
ja: メディアプレーヤーで次のトラックを選択する

source: Select previous track in media player
ja: メディアプレーヤーで前のトラックを選択する

source: Select the browser "back" button
ja: ブラウザの「戻る」ボタンを選択する

source: Select the browser "favorites" button
ja: ブラウザの「お気に入り」ボタンを選択

source: Select the browser "forward" button
ja: ブラウザの「進む」ボタンを選択する

source: Select the browser "refresh" button
ja: ブラウザの「更新」ボタンを選択する

source: Select the browser "search" button
ja: ブラウザの「検索」ボタンを選択する

source: Select the browser "stop" button
ja: ブラウザの「停止」ボタンを選択する

source: Select the menu item "View->Key history"
ja: メニューの「View->Key history」を選択します

source: Select the new item in the tree at the left and enter the following information:
ja: 左のツリーで新規項目を選択し、以下の情報を入力します：

source: Selected tab:
ja: 選択されたタブ：

source: Selected tabs appear as being indented into the background while other tabs appear as being on the same plane as the background.
ja: 選択されたタブは背景の中にインデントされて表示され、他のタブは背景と同じ平面に表示される。

source: SelectedFiles := FileSelect("M3") ; M3 = Multiselect existing files.
ja: SelectedFiles := FileSelect("M3") ; M3 = 既存ファイルをマルチセレクトします。

source: SelectedFolder := DirSelect("::{20d04fe0-3aea-1069-a2d8-08002b30309d}") ; My Computer.
ja: SelectedFolder := DirSelect("::{20d04fe0-3aea-1069-a2d8-08002b30309d}") ; マイコンピュータ。

source: Selects View -> Lines most recently executed in the main window.
ja: メインウィンドウでView -> Lines most recently executedを選択します。

source: Selects or de-selects all rows by specifying 0 as the row number.
ja: 行番号に0を指定して、すべての行を選択または非選択にします。

source: Selects the File->Save menu (Alt+F followed by S).
ja: ファイル」→「保存」メニュー（Alt+Fの後にSを付ける）を選択します。

source: Selects the row.
ja: 行を選択します。

source: Send "#r" ; Open the Run dialog.
ja: Send "#r" ; 「ファイル名を指定して実行」ダイアログを開く。

source: Send "^e" ; Ctrl+E opens the Image Properties dialog.
ja: Send "^e" ; Ctrl+Eはイメージのプロパティダイアログを開きます。

source: Send "^n" ; Create new/blank e-mail via Control+N.
ja: Send "^n" ; Control+Nで新しいメールを作成します。

source: Send "{Esc}" ; Close the Run dialog.
ja: Send "{Esc}" ; 「ファイル名を指定して実行」ダイアログを閉じます。

source: Send "{F5}" ; pastes time and date
ja: Send "{F5}" ; 時刻と日付を貼り付けます。

source: Send "{Left down}" ; Hold down the left-arrow key.
ja: Send "{Left down}" ; 左矢印キーを押し続けます。

source: Send "{Tab 2}Product Recall for ACME Rocket Skates" ; Set the subject line.
ja: Send "{Tab 2}Product Recall for ACME Rocket Skates" ; タイトル行にセットします。

source: Send "{Volume_Down 3}" ; Lower the master volume by 3 intervals.
ja: Send "{Volume_Down 3}" ; マスター音量を3段階下げます。

source: Send "{Volume_Mute}" ; Mute/unmute the master volume.
ja: Send "{Volume_Mute}" ; マスターボリュームをミュート、またはミュートを解除します。

source: Send "{Volume_Up}" ; Raise the master volume by 1 interval (typically 5%).
ja: Send "{Volume_Up}" ; マスター音量を1段階（通常5%）上げます。

source: Send - Syntax & Usage | AutoHotkey v2
ja: Send - 構文と使用法｜AutoHotkey v2

source: Send FormatTime(, "M/d/yyyy h:mm tt") ; It will look like 9/1/2005 3:53 PM
ja: Send FormatTime(, "M/d/yyyy h:mm tt") ; 「9/1/2005 3:53 PM」のように表示されます。

source: Send a description of the warning to stdout (the program's standard output stream), along with the filename and line number.
ja: 警告の説明をファイル名と行番号とともに標準出力（プログラムの標準出力ストリーム）に送信します。

source: Send a description of the warning to the debugger for display.
ja: 警告の説明をデバッガに送信して表示させる。

source: Send does not wait for Win to be released even if the text contains an L keystroke.
ja: 送信は、テキストにLキーが含まれていても、Winの解除を待たずに送信します。

source: Send is case-sensitive.
ja: 送信は大文字と小文字を区別します。

source: Send supports a few other special constructs, such as:
ja: Sendは、他にもいくつかの特殊な構成要素をサポートしています：

source: Send syntax errors that prevent a script from launching to the standard error stream (stderr) rather than displaying a dialog.
ja: スクリプトの起動を妨げる構文エラーを、ダイアログを表示するのではなく、標準エラーストリーム（stderr）に送る。

source: Send the replacement text raw; that is, without translating {Enter} to Enter, ^c to Ctrl+C, etc.
ja: つまり、{Enter}をEnterに、^cをCtrl+Cなどに変換せずに、生のまま置換テキストを送信します。

source: Send the replacement text using Text mode.
ja: テキストモードを使って、置換テキストを送信します。

source: Send the string "This is a test." followed by Enter.
ja: 文字列「This is a test.」に続いてEnterを送信します。

source: SendEvent and SendInput use SendInput() with the KEYEVENTF_UNICODE flag.
ja: SendEventとSendInputは、KEYEVENTF_UNICODEフラグ付きのSendInput()を使用します。

source: SendEvent sends keystrokes using the Windows keybd_event function (search Microsoft Docs for details).
ja: SendEventは、Windowsのkeybd_event関数（詳細はMicrosoft Docsを検索）を使用してキーストロークを送信します。

source: SendInput FormatTime(, "M/d/yyyy h:mm tt") ; It will look like 9/1/2005 3:53 PM
ja: SendInput FormatTime(, "M/d/yyyy h:mm tt") ; 2005年9月1日 3:53 PM

source: SendInput and SendPlay use the same syntax as SendEvent but are generally faster and more reliable.
ja: SendInputとSendPlayはSendEventと同じ構文を使用しますが、一般的により高速で信頼性が高いです。

source: SendInput is generally the most reliable, so by default, Send is synonymous with SendInput.
ja: 一般的にSendInputが最も信頼性が高いので、デフォルトではSendはSendInputと同義です。

source: SendInput is generally the preferred method to send keystrokes and mouse clicks because of its superior speed and reliability.
ja: SendInputは、その優れた速度と信頼性から、一般的にキーストロークやマウスクリックを送信する方法として好まれています。

source: SendLevel - Syntax & Usage | AutoHotkey v2
ja: SendLevel - 構文と使用法｜AutoHotkey v2

source: SendLevel allows to trigger hotkeys and hotstrings of another script, which normally would not be the case.
ja: SendLevelは、通常ではありえない、他のスクリプトのホットキーやホットストリングをトリガーすることができます。

source: SendLevel and #InputLevel provide the means to achieve this.
ja: SendLevelと#InputLevelは、そのための手段を提供します。

source: SendLevel sets the level for events generated by the current script thread, while #InputLevel sets the level for any hotkeys or hotstrings beneath it.
ja: SendLevelは現在のスクリプトスレッドが生成するイベントのレベルを設定し、#InputLevelはその下にあるホットキーやホットストリングのレベルを設定します。

source: SendMessage - Syntax & Usage | AutoHotkey v2
ja: SendMessage - 構文と使用法｜AutoHotkey v2

source: SendMessage 0x000C, 0, StrPtr("New Title") ; 0X000C is WM_SETTEXT
ja: SendMessage 0x000C, 0, StrPtr("New Title") ; 0X000CはWM_SETTEXTです。

source: SendMessage 0x001A,,,, 0xFFFF ; 0x001A is WM_SETTINGCHANGE
ja: SendMessage 0x001A,,,, 0xFFFF ; 0x001AはWM_SETTINGCHANGEです。

source: SendMessage 0x0114, 0, 0, ControlGetFocus("A") ; 0x0114 is WM_HSCROLL and the 0 after it is SB_LINELEFT.
ja: SendMessage 0x0114, 0, 0, ControlGetFocus("A") ; 0x0114 は WM_HSCROLL、その次の 0 は SB_LINELEFT です。

source: SendMessage 0x0114, 1, 0, ControlGetFocus("A") ; 0x0114 is WM_HSCROLL and the 1 after it is SB_LINERIGHT.
ja: SendMessage 0x0114, 1, 0, ControlGetFocus("A") ; 0x0114 は WM_HSCROLL、その次の 1 は SB_LINERIGHT です。

source: SendMessage and PostMessage now throw an exception on failure (or timeout) and do not set ErrorLevel.
ja: SendMessageとPostMessageは、失敗（またはタイムアウト）時に例外を投げるようになり、ErrorLevelを設定しないようになりました。

source: SendMessage returns the message reply.
ja: SendMessageは、メッセージの返信を返します。

source: SendMessage waits for the target window to process the message, up until the timeout period expires.
ja: SendMessageは、ターゲットウィンドウがメッセージを処理するのを、タイムアウト時間まで待ちます。

source: SendMessage(0x0080, 1, hIcon, MyGui) ; 0x0080 is WM_SETICON; and 1 means ICON_BIG (vs. 0 for ICON_SMALL).
ja: SendMessage(0x0080, 1, hIcon, MyGui) ; 0x0080はWM_SETICONで、1はICON_BIG（ICON_SMALLは0）を意味します。

source: SendMessage, 0x0028, hWndControl, True ; 0x0028 is WM_NEXTDLGCTL
ja: SendMessage, 0x0028, hWndControl, True ; 0x0028 は WM_NEXTDLGCTL です。

source: SendMode - Syntax & Usage | AutoHotkey v2
ja: SendMode - 構文と使用法｜AutoHotkey v2

source: SendPlay does not trigger AutoHotkey's hotkeys or hotstrings, or global hotkeys registered by other programs or the OS.
ja: SendPlayは、AutoHotkeyのホットキーやホットストリング、他のプログラムやOSが登録したグローバルホットキーをトリガーしません。

source: SendPlay does not use the standard settings of SetKeyDelay and SetMouseDelay.
ja: SendPlayは、標準設定のSetKeyDelayと SetMouseDelayを使用しません。

source: SendPlay is unable to turn on or off CapsLock, NumLock, or ScrollLock.
ja: SendPlayは、CapsLock、NumLock、ScrollLockのオン/オフを切り替えることができません。

source: SendPlay may have no effect at all if User Account Control is enabled, even if the script is running as an administrator.
ja: ユーザーアカウント制御が有効な場合、スクリプトが管理者として実行されていても、SendPlayが全く効果を発揮しない場合があります。

source: SendPlay uses the Alt+nnnnn method, which produces Unicode only if supported by the target application.
ja: SendPlayはAlt+nnnnメソッドを使用し、ターゲットアプリケーションがサポートしている場合のみ、Unicodeを生成します。

source: SendPlay's biggest advantage is its ability to "play back" keystrokes and mouse clicks in a broader variety of games than the other modes.
ja: SendPlayの最大の特徴は、他のモードよりも幅広いゲームにおいて、キーストロークやマウスクリックを「再生」できることです。

source: SendRaw (use Send "{Raw}" or SendText instead)
ja: SendRaw （代わりにSend "{Raw}"またはSendTextを使用します）

source: SendText sends the text verbatim, but keep in mind the rules of the language.
ja: SendTextは、テキストをそのまま送信しますが、言語のルールに注意してください。

source: Sending Keystrokes
ja: キー入力の送信

source: Sending a key does not perfectly replicate the act of physically pressing the key.
ja: キーを送信しても、物理的にキーを押すという行為を完全に再現することはできません。

source: Sending a lot of text
ja: テキストを大量に送信する

source: Sending keys and key combinations
ja: キーとキーの組み合わせの送信

source: Sending keystrokes (or keys for short) is the most common method of automating programs, because it is the one that works most generally.
ja: キーストローク（略してキー）の送信は、最も一般的に機能するため、プログラムを自動化する方法として最も一般的です。

source: Sending keystrokes or mouse clicks while the expression is being evaluated (such as from a function which it calls) may cause complications and should be avoided.
ja: 式の評価中にキー操作やマウスクリックを行うと（式が呼び出す関数からなど）、操作が複雑になる可能性があるため、避けてください。

source: Sending {CapsLock} might require SetStoreCapsLockMode False beforehand.
ja: {CapsLock}を送信する場合、事前にSetStoreCapsLockMode Falseが必要な場合があります。

source: Sends Alt.
ja: Altを送る。

source: Sends Ctrl.
ja: Ctrlを送る。

source: Sends Shift.
ja: Shiftを送る。

source: Sends Win (the key with the Windows logo) therefore Send "#e" would hold down Win and then press E.
ja: Win（Windows ロゴのあるキー）を送信するので、Send "#e"を送信するには、Winを押しながらEを押します。

source: Sends a Pause command to another script.
ja: 他のスクリプトにPauseコマンドを送信します。

source: Sends a Suspend command to another script.
ja: 別のスクリプトにサスペンドコマンドを送信します。

source: Sends a Unicode character where nnnn is the hexadecimal value of the character excluding the 0x prefix.
ja: Unicode 文字を送信します。nnnnは、0x 接頭辞を除いた文字の 16 進数値です。

source: Sends a file or directory to the recycle bin if possible, or permanently deletes it.
ja: ファイルやディレクトリを可能な限りごみ箱に送ったり、永久に削除したりします。

source: Sends a keystroke that has virtual key XX and scan code YYY.
ja: 仮想キーXXとスキャンコードYYYを持つキーストロークを送信します。

source: Sends a long series of raw characters via the fastest method.
ja: 最速の方法で、長い一連の生文字を送信します。

source: Sends a message to a window or control and waits for acknowledgement.
ja: ウィンドウまたはコントロールにメッセージを送信し、応答を待ちます。

source: Sends a mouse button event at the cursor's current position (to have control over position and other options, use {Click} above).
ja: カーソルの現在位置でマウスボタンイベントを送信します（位置やその他のオプションを制御するには、上記の{Click}を使用します）。

source: Sends a mouse button or mouse wheel event to a control.
ja: マウスボタンまたはマウスホイールイベントをコントロールに送信します。

source: Sends a mouse click using the same options available in the Click function.
ja: クリック機能と同じオプションを使って、マウスクリックを送信します。

source: Sends a string of any length from one script to another.
ja: あるスクリプトから別のスクリプトへ、任意の長さの文字列を送信します。

source: Sends a string to the debugger (if any) for display.
ja: デバッガがある場合に文字列を送信して表示させます。

source: Sends a warning to OutputDebug for each undeclared local variable which has the same name as a global variable.
ja: グローバル変数と同じ名前を持つ宣言されていないローカル変数に対して、OutputDebugに警告を送ります。

source: Sends all .tmp files in a directory to the recycle bin if possible.
ja: ディレクトリ内のすべての .tmp ファイルを可能な限りごみ箱に送ります。

source: Sends an Alt+nnnnn keypad combination, which can be used to generate special characters that don't exist on the keyboard.
ja: Alt+nnnnのキーパッドの組み合わせを送信します。キーボードに存在しない特殊文字を生成するために使用することができます。

source: Sends any syntax error that prevents a script from launching to the standard error stream (stderr) rather than displaying a dialog.
ja: スクリプトの起動を妨げる構文エラーは、ダイアログを表示するのではなく、標準エラーストリーム（stderr）に送信します。

source: Sends any syntax error that prevents the script from launching to stderr rather than displaying a dialog.
ja: スクリプトの起動を妨げる構文エラーは、ダイアログを表示するのではなく、標準エラーとして送信されます。

source: Sends simulated keystrokes and mouse clicks to the active window.
ja: キーストロークやマウスクリックのシミュレーションをアクティブウィンドウに送信します。

source: Sends simulated keystrokes or text to a window or control.
ja: キーストロークやテキストをシミュレーションして、ウィンドウやコントロールに送信します。

source: Sends the parent window the STN_CLICKED notification when the user clicks the control.
ja: ユーザーがコントロールをクリックすると、親ウィンドウにSTN_CLICKED通知を送信します。

source: Sends the specified window to the bottom of stack; that is, beneath all other windows.
ja: 指定されたウィンドウをスタックの一番下、つまり他のすべてのウィンドウの下に送ります。

source: Separate each component from the next with at least one space, tab, and/or comma (within a string or as separate parameters).
ja: 各コンポーネントは、少なくとも1つのスペース、タブ、カンマで次のコンポーネントと区切る（文字列内または個別のパラメータとして）。

source: Separate each option from the next with a single space or tab.
ja: 各オプションと次のオプションは、1つのスペースまたはタブで区切ってください。

source: Separate each option from the next with a space (e.g. "C Fast").
ja: 各オプションと次のオプションはスペースで区切ってください（例："C Fast"）。

source: Separate each option from the next with a space or tab.
ja: 各オプションと次のオプションはスペースまたはタブで区切る。

source: Separate each word from the next with a space or tab.
ja: 単語と単語の間は、スペースまたはタブで区切る。

source: Separate functions may also safely use the same variable names.
ja: また、別々の関数が同じ変数名を安全に使用することができます。

source: Separate parameters with spaces.
ja: パラメータはスペースで区切ってください。

source: Separates a comma-separated list of colors into an array of substrings and traverses them, one by one.
ja: カンマで区切られた色のリストを部分文字列の配列に分割し、1つずつ走査する。

source: Separates a file name or URL into its name, directory, extension, and drive.
ja: ファイル名やURLを、名前、ディレクトリ、拡張子、ドライブに分離します。

source: Separates a sentence into an array of words and reports the fourth word.
ja: 文を単語の配列に分割し、4番目の単語を報告する。

source: Separates a string into an array of substrings using the specified delimiters.
ja: 指定された区切り文字を使用して、文字列を部分文字列の配列に分離します。

source: Set an object's base object.
ja: オブジェクトのベースオブジェクトを設定する。

source: Set and remove breakpoints on lines - pause execution when a breakpoint is reached.
ja: 行のブレークポイントの設定と削除 -ブレークポイントに達すると実行を一時停止。

source: Set as default:
ja: デフォルト設定：

source: Set as default: Sets the template to be selected by default.
ja: Set as default：デフォルトで選択されるテンプレートを設定します。

source: Set at least one breakpoint.
ja: 少なくとも1つのブレークポイントを設定します。

source: Set folder as default:
ja: フォルダをデフォルトに設定する：

source: Set folder as default: Sets the current folder as the default location to save scripts.
ja: Set folder as default：スクリプトを保存するデフォルトの場所として、現在のフォルダを設定します。

source: Set scripts to run with UI access by default, by checking the appropriate box in the Launch Settings GUI.
ja: 起動設定GUIの該当するボックスにチェックを入れて、デフォルトでUIアクセスでスクリプトを実行するように設定します。

source: Set the base of the new object to ClassObj.Prototype.
ja: 新しいオブジェクトのベースをClassObj.Prototypeに設定します。

source: Set the default editor for .ahk files.
ja: .ahkファイルのデフォルトエディタを設定します。

source: Set to 0 to leave unchanged.
ja: 変更しない場合は0を設定する。

source: Set to 1 to change the executable to require administrative privileges when run.
ja: 実行時に管理者権限を必要とする実行ファイルに変更するには1を設定する。

source: Set to 2 to change the executable to request highest available privileges when run.
ja: 実行時に利用可能な最高権限を要求するように実行ファイルを変更するには2を設定する。

source: SetBatchLines (-1 is now the default behaviour)
ja: SetBatchLines（-1がデフォルトの動作になりました）

source: SetBatchLines has been removed, so all scripts run at full speed (equivalent to SetBatchLines -1 in v1).
ja: SetBatchLinesが削除されたため、すべてのスクリプトがフルスピードで実行されます（v1のSetBatchLines -1に相当）。

source: SetCapsLockState / SetNumLockState / SetScrollLockState - Syntax & Usage | AutoHotkey v2
ja: SetCapsLockState / SetNumLockState / SetScrollLockState - 構文と使用法｜AutoHotkey v2

source: SetControlDelay - Syntax & Usage | AutoHotkey v2
ja: SetControlDelay - 構文と使用法｜AutoHotkey v2

source: SetControlDelay -1 ; May improve reliability and reduce side effects.
ja: SetControlDelay -1 ; 信頼性を向上させ、副作用を低減させることができる。

source: SetDefaultMouseSpeed - Syntax & Usage | AutoHotkey v2
ja: SetDefaultMouseSpeed - 構文と使用法｜AutoHotkey v2

source: SetDefaultMouseSpeed is ignored for SendInput/Play modes; they move the mouse instantaneously (except when SendInput reverts to SendEvent; also, SetMouseDelay has a mode that applies to SendPlay).
ja: SetDefaultMouseSpeedはSendInput/Playモードでは無視されます。これらはマウスを瞬時に動かします（SendInputがSendEventに戻った場合を除く、また、SetMouseDelayにはSendPlayに適用されるモードがあります）。

source: SetDefaultMouseSpeed is ignored for the modes SendInput and SendPlay; they move the mouse instantaneously (except when SendInput reverts to SendEvent; also, SetMouseDelay has a mode that applies to SendPlay).
ja: SetDefaultMouseSpeed関数は、SendInputおよびSendPlayモードでは無視されます。これらのモードでは、マウスは瞬時に移動します。ただし、SendInputがSendEventに戻る場合を除きます。また、SetMouseDelayにはSendPlayに適用されるモードがあります。

source: SetFormat (Format can be used to format a string)
ja: SetFormat（Formatは文字列の書式設定に使用できます）

source: SetFormat, Integer, H is case-sensitive
ja: SetFormat, Integer, Hは大文字小文字を区別します

source: SetKeyDelay - Syntax & Usage | AutoHotkey v2
ja: SetKeyDelay - 構文と使用法｜AutoHotkey v2

source: SetKeyDelay 75, 25 ; 75ms between keys, 25ms between down/up.
ja: SetKeyDelay 75, 25 ; キー間75ms、ダウン/アップ間25ms。

source: SetKeyDelay is not obeyed by SendInput; there is no delay between keystrokes in that mode.
ja: SetKeyDelayはSendInputでは従わない。そのモードではキーストローク間の遅延はない。

source: SetMainIcon
ja: メインアイコンの設定

source: SetMouseDelay - Syntax & Usage | AutoHotkey v2
ja: SetMouseDelay - 構文と使用法｜AutoHotkey v2

source: SetRegView - Syntax & Usage | AutoHotkey v2
ja: SetRegView - 構文と使用法｜AutoHotkey v2

source: SetRegView allows the registry functions in a 32-bit script to access redirected keys in the 64-bit registry view and vice versa.
ja: SetRegViewにより、32ビットスクリプトのレジストリ関数が64ビットレジストリビューのリダイレクトされたキーにアクセスできるようになり、その逆も可能です。

source: SetStoreCapsLockMode - Syntax & Usage | AutoHotkey v2
ja: SetStoreCapsLockMode - 構文と使用法｜AutoHotkey v2

source: SetSystemTime("20051008142211") ; Pass it a timestamp (local, not UTC).
ja: SetSystemTime("20051008142211") ; タイムスタンプを渡す（UTCではなくローカル）。

source: SetTimer () => MsgBox("Hello!"), -1000 ; Says hello after 1 second.
ja: SetTimer () => MsgBox("Hello!"), -1000 ; 1秒後に「こんにちは」を表示します。

source: SetTimer - Syntax & Usage | AutoHotkey v2
ja: SetTimer - 構文と使用法｜AutoHotkey v2

source: SetTimer tick, 0 ; Using the closure's original var is safe.
ja: SetTimer tick, 0 ; クロージャーのオリジナル変数を使うのが無難です。
